{
    "_wap_tags": "Android",
    "@odata.type": "#microsoft.graph.androidWorkProfileCompliancePolicy",
    "description": null,
    "version": 1,
    "passwordRequired": true,
    "passwordMinimumLength": null,
    "passwordRequiredType": "deviceDefault",
    "requiredPasswordComplexity": "medium",
    "passwordMinutesOfInactivityBeforeLock": null,
    "passwordExpirationDays": null,
    "passwordPreviousPasswordBlockCount": null,
    "passwordSignInFailureCountBeforeFactoryReset": null,
    "securityPreventInstallAppsFromUnknownSources": false,
    "securityDisableUsbDebugging": false,
    "securityRequireVerifyApps": false,
    "deviceThreatProtectionEnabled": false,
    "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
    "securityBlockJailbrokenDevices": true,
    "osMinimumVersion": null,
    "osMaximumVersion": null,
    "minAndroidSecurityPatchLevel": null,
    "storageRequireEncryption": true,
    "securityRequireSafetyNetAttestationBasicIntegrity": true,
    "securityRequireSafetyNetAttestationCertifiedDevice": false,
    "securityRequireGooglePlayServices": true,
    "securityRequireUpToDateSecurityProviders": false,
    "securityRequireCompanyPortalAppIntegrity": true,
    "securityRequiredAndroidSafetyNetEvaluationType": "basic",
    "scheduledActionsForRule": []
}
